InformationRegisters/Renault_Advanced_РеквизитыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_Advanced_РеквизитыДоговоровКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автодоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Advanced_Договоры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндивидуальныеУсловияПоНаборам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправкаДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПечатьПодтвержденияУщерба</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПечатьСтраховщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажаСтраховогоПолиса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВедениеВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_Advanced_ВедениеВзаиморасчетовПоДоговорам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВестиПоДокументамРасчетовСКонтрагентом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидАгентскогоДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_Advanced_ВидыАгентскихДоговоров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Advanced_ВидыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУсловийДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_Advanced_ВидыУсловийДоговоровВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДержатьРезервБезОплатыОграниченноеВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопустимоеЧислоДнейЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьДенежныеСредстваКомитента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьСуммуЗадолженности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьЧислоДнейЗадолженности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеДляСчетаФактурыНаАванс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленныйУчетТоваровПоЗаказамПокупателей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяСтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гарантийный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Страховой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЦенСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокРегистрацииСчетовФактурНаАвансПоДоговору</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_Advanced_ПорядокРегистрацииСчетовФактурНаАванс</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетыВУсловныхЕдиницах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеализацияНаЭкспорт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаКомиссионногоВознаграждения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_Advanced_СпособыРасчетаКомиссионногоВознаграждения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетАгентскогоНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧислоДнейРезерваБезОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_Advanced_ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_Advanced_ВедениеВзаиморасчетовПоДоговорам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
			<Comment>Виды договоров</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
					<Comment>Договоры с поставщиками</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Договоры с покупателями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>Договор комиссии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>Договор с комитентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Общий договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
					<Comment>Договор кредита</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчет</Name>
					<Comment>По умолчанию для контрагентов такого вида выбирается именно такой тип договора</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
					<Comment>Зарплата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатОтветственности</Name>
					<Comment>О материальной ответственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/Renault_Advanced_ЗаполнениеДокументов/Ext/Module.bsl
// Проверяет. можно ли использовать переданный договор в соответствии с переданными параметрами.
//
// Параметры
//  Договор                                 – ссылка на договор, который нужно проверить,
//  Контрагент                              - ссылка на контрагента, которому должен принадлежать договор,
//  Организация                             - ссылка на организацию, от имени которой должен быть выписан договор,
//  СтруктураПараметровДляПолученияДоговора - структура, содержащая параметры для определения договора:
//                                            список допустимых видов договоров и
//                                            список допустимых способов ведения взаиморасчетов.
//
// Возвращаемое значение:
//   Логическое, Истина - можно использовать, ложь - нельзя.
//
Функция МожноИспользоватьДоговорДляДокумента(Договор, Контрагент, Организация, СтруктураПараметровДляПолученияДоговора) Экспорт

	Перем СписокДопустимыхВидовДоговоров, СписокДопустимыхВидовВзаиморасчетов, ВалютаВзаиморасчетовДоговора, ВидСравненияВалютыВзаиморасчетов;


	Если Не ЗначениеЗаполнено(Договор) Тогда
		Возврат Ложь; // Если не передали параметры, то считаем, что нельзя использовать.
	КонецЕсли;

	Если СтруктураПараметровДляПолученияДоговора <> Неопределено Тогда
		СтруктураПараметровДляПолученияДоговора.Свойство("СписокДопустимыхВидовДоговоров", СписокДопустимыхВидовДоговоров);
		СтруктураПараметровДляПолученияДоговора.Свойство("СписокДопустимыхВидовВзаиморасчетов", СписокДопустимыхВидовВзаиморасчетов);
		СтруктураПараметровДляПолученияДоговора.Свойство("ВалютаВзаиморасчетовДоговора", ВалютаВзаиморасчетовДоговора);
		СтруктураПараметровДляПолученияДоговора.Свойство("ВидСравненияВалютыВзаиморасчетов", ВидСравненияВалютыВзаиморасчетов);
	КонецЕсли;

	// Организация должна совпадать.
	Если ЗначениеЗаполнено(Организация)
	   И Организация <> Договор.Организация Тогда
		Возврат Ложь;
	КонецЕсли;

	// Контрагент должен совпадать, если в документе невыбран контрагент, то любой договор не подходит.
	Если Контрагент <> Договор.Владелец Тогда
		Возврат Ложь;
	КонецЕсли;

	// Проверка по виду договора.
	Если СписокДопустимыхВидовДоговоров <> Неопределено 
	   И СписокДопустимыхВидовДоговоров.НайтиПоЗначению(Договор.ВидДоговора) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	// Проверка по виду взаиморасчетов.
	Если СписокДопустимыхВидовВзаиморасчетов <> Неопределено 
	   И СписокДопустимыхВидовВзаиморасчетов.НайтиПоЗначению(Renault_AdvancedКлиент.ПолучитьРеквизитОбъекта(Договор, "ВедениеВзаиморасчетов")) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	// Проверка по валюте взаиморасчетов.
	Если ВалютаВзаиморасчетовДоговора <> Неопределено
	   И ВидСравненияВалютыВзаиморасчетов <> Неопределено Тогда
		Если ВидСравненияВалютыВзаиморасчетов = "=" Тогда
			Если Договор.ВалютаВзаиморасчетов <> ВалютаВзаиморасчетовДоговора Тогда
				Возврат Ложь;
			КонецЕсли;
		Иначе // ВидСравненияВалютыВзаиморасчетов может принимать только два значения: "=" и "<>".
			Если Договор.ВалютаВзаиморасчетов = ВалютаВзаиморасчетовДоговора Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Возврат Истина;

КонецФункции // МожноИспользоватьДоговорДляДокумента()

// Функция определяет договор, соответствующий указанным значениям
// организации и контрагента, а также переданным параметрам.
// Если всем параметрам удовлетворяет основной договор, то выбирается он.
//
// Параметры
//  Организация                             - организация, по которой определяется договор
//  Контрагент                              - конрагент, по которому определяется договор
//  СтруктураПараметровДляПолученияДоговора - структура, содержащая параметры для определения договора:
//                                            список допустимых видов договоров и
//                                            список допустимых способов ведения взаиморасчетов, не обязательный.
//
// Возвращаемое значение:
//  Договор - договор контрагентов
//
Функция ПолучитьДоговорПоОрганизацииИКонтрагенту(Организация, Контрагент, СтруктураПараметровДляПолученияДоговора = Неопределено) Экспорт

	Перем СписокДопустимыхВидовДоговоров, СписокДопустимыхВидовВзаиморасчетов, ВалютаВзаиморасчетовДоговора, ВидСравненияВалютыВзаиморасчетов;

	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Неопределено;
	КонецЕсли;

	// Если не передана организация, то проверим, можно ли использовать основной договор. 
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Договор = Renault_Advanced_ОбщегоНазначения.ПолучитьОсновнойДоговорКонтрагента(Контрагент);
		Если МожноИспользоватьДоговорДляДокумента(Договор, Контрагент, Организация, СтруктураПараметровДляПолученияДоговора) Тогда
			Возврат Договор;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
			
	РезультатЗапроса = ПолучитьДоступныеДоговорыКонтрагента(Контрагент, СтруктураПараметровДляПолученияДоговора, Истина, Организация );
	ТаблицаДоговоров = РезультатЗапроса.Выгрузить();

	Если ТаблицаДоговоров.Количество() = 1 Тогда
		Возврат ТаблицаДоговоров[0].Договор;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции // ПолучитьДоговорПоОрганизацииИКонтрагенту()

// Процедура предназначена для заполнения общих реквизитов документов,
// вызывается в обработчиках событий "ПриОткрытии" в модулех форм всех документов.
//
// Параметры:
//  ДокументОбъект                          - объект редактируемого документа,
//  ТекПользователь                         - ссылка на справочник, определяет текущего пользователя  
//  ВалютаРегламентированногоУчета          - валюта регламентированного учета,
//  ТипОперации                             - необязаетельный, строка вида операции ("Покупка" или "Продажа"),
//                                            если не передан, то реквизиты, зависящие от вида операции, не заполняются,
//  ПараметрОбъектКопирования               - ссылка на объект копирования,
//  ПараметрОснование                       - ссылка на объект-основание.
//  СтруктураПараметровДляПолученияДоговора - Структура содержит список допустимых видов договоров.
//
Процедура ЗаполнитьШапкуДокумента(ДокументОбъект, ТекПользователь, ВалютаРегламентированногоУчета = Неопределено, ТипОперации = "", ПараметрОбъектКопирования = Неопределено, ПараметрОснование = неопределено, СтруктураПараметровДляПолученияДоговора = Неопределено) Экспорт

	МетаданныеДокумента = ДокументОбъект.Метаданные();

	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("Ответственный", МетаданныеДокумента) Тогда
		//ДокументОбъект.Ответственный = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойОтветственный");
	КонецЕсли;

	#Если Клиент Тогда
	Если ПараметрОбъектКопирования <> Неопределено 
	   И Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("КурсВзаиморасчетов", МетаданныеДокумента) Тогда
	    СтруктураКурсаДокумента = Renault_Advanced_МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДокументОбъект.Дата);
		Если СтруктураКурсаДокумента.Курс <> ДокументОбъект.КурсВзаиморасчетов 
		 Или СтруктураКурсаДокумента.Кратность <> ДокументОбъект.КратностьВзаиморасчетов Тогда
			Ответ = Вопрос("Курс валюты изменился. Поменять курс в документе?", РежимДиалогаВопрос.ДаНет);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				ДокументОбъект.КурсВзаиморасчетов = СтруктураКурсаДокумента.Курс;
				Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("КратностьВзаиморасчетов", МетаданныеДокумента) Тогда
					ДокументОбъект.КратностьВзаиморасчетов = СтруктураКурсаДокумента.Кратность;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	#КонецЕсли

	// Заполним флаги принадлежности к учету исходя из значений по умолчанию.
	//Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("DMS_ОтражатьВУправленческомУчете", МетаданныеДокумента) Тогда
	//	ДокументОбъект.DMS_ОтражатьВУправленческомУчете = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОтражатьДокументыВУправленческомУчете");
	//КонецЕсли;

	// Флаги БУ и НУ взаимосвязаны, не возможна ситуация, когда флаг НУ "истина". а флаг БУ "ложь".
	// А также надо проверить признак отражения организации в регл. учете.
	ФлагОтражРеглУчете = Ложь;

	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("КассаККМ", МетаданныеДокумента) Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.КассаККМ) Тогда
			ДокументОбъект.КассаККМ = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяКассаККМ");
		КонецЕсли;
	КонецЕсли;

	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) Тогда

		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("КассаККМ", МетаданныеДокумента) Тогда
			Если НЕ ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
				Если ЗначениеЗаполнено(ДокументОбъект.КассаККМ) Тогда
					ДокументОбъект.Организация = ДокументОбъект.КассаККМ.Владелец;
				Иначе
					ДокументОбъект.Организация = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяОрганизация");
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если НЕ ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
				//ДокументОбъект.Организация = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяОрганизация");
				ДокументОбъект.Организация = ПараметрыСеанса.Организация;
			КонецЕсли;
		КонецЕсли;

		//если значение настройки заполнено (организация для пользователя определена и доступна), флаг устанавливается по данным организации
		//	если значение настройки не заполнено, флаг сбрасывается
		ФлагОтражРеглУчете = ЗначениеЗаполнено(ДокументОбъект.Организация);

		//Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("DMS_ОтражатьВБухгалтерскомУчете", МетаданныеДокумента) Тогда

		//	// организация отражается в регламентированном учете
		//	Если ФлагОтражРеглУчете Тогда
		//		ФлагОтражатьВБухгалтерскомУчете = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОтражатьДокументыВБухгалтерскомУчете");
		//		ДокументОбъект.DMS_ОтражатьВБухгалтерскомУчете = ФлагОтражатьВБухгалтерскомУчете;
		//		
		//		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("DMS_ОтражатьВНалоговомУчете", МетаданныеДокумента) Тогда
		//			Если ФлагОтражатьВБухгалтерскомУчете Тогда

		//				//флаг может устанавливаться только если установлено отражение в БУ
		//				ДокументОбъект.DMS_ОтражатьВНалоговомУчете = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОтражатьДокументыВНалоговомУчете");
		//			Иначе
		//				ДокументОбъект.DMS_ОтражатьВНалоговомУчете = Ложь;
		//			КонецЕсли;
		//		КонецЕсли;
		//		
		//	Иначе
		//		ДокументОбъект.DMS_ОтражатьВБухгалтерскомУчете = Ложь;
		//		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("DMS_ОтражатьВНалоговомУчете", МетаданныеДокумента) Тогда
		//			ДокументОбъект.DMS_ОтражатьВНалоговомУчете = Ложь;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
	КонецЕсли; 

	//если копируем - возврат из процедуры
	Если ПараметрОбъектКопирования<>неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("Подразделение", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.Подразделение)) Тогда
		//ДокументОбъект.Подразделение = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновноеПодразделение");
		ДокументОбъект.Подразделение = ПараметрыСеанса.ПодразделениеКомпании;
	ИначеЕсли Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("ПодразделениеКомпании", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ПодразделениеКомпании)) Тогда
		//ДокументОбъект.ПодразделениеКомпании = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновноеПодразделение");
		ДокументОбъект.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
	КонецЕсли;
	
	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("ДоговорЭквайринга", МетаданныеДокумента) Тогда
		ДокументОбъект.ДоговорЭквайринга = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойДоговорЭквайринга");
	КонецЕсли;

	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("ВидОперации", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ВидОперации)) Тогда
		ДокументОбъект.ВидОперации = Перечисления[ДокументОбъект.ВидОперации.Метаданные().Имя][0];
	КонецЕсли;

	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("Склад", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.Склад)) Тогда
		ДокументОбъект.Склад = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойСклад");
	ИначеЕсли Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("СкладКомпании", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.СкладКомпании)) Тогда
		ДокументОбъект.СкладКомпании = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойСклад");
	КонецЕсли;

	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("DMS_СкладГруппа", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.DMS_СкладГруппа)) Тогда
		ДокументОбъект.DMS_СкладГруппа = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойСклад");
	КонецЕсли;

	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("СкладОрдер", МетаданныеДокумента) 
	   И Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("ВидПоступления", МетаданныеДокумента)
	   И НЕ ЗначениеЗаполнено(ДокументОбъект.СкладОрдер) И НЕ ЗначениеЗаполнено(ДокументОбъект.ВидПоступления) Тогда
		ДокументОбъект.СкладОрдер = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойСклад");
		ДокументОбъект.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
	КонецЕсли;

	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("СтавкаНДС", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.СтавкаНДС)) Тогда
		ДокументОбъект.СтавкаНДС = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяСтавкаНДС");
	КонецЕсли;

	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", МетаданныеДокумента)
	   И ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда

		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("СчетОрганизации", МетаданныеДокумента) Тогда
			Если НЕ ЗначениеЗаполнено(ДокументОбъект.СчетОрганизации) Тогда
				ДокументОбъект.СчетОрганизации = ДокументОбъект.Организация.ОсновнойБанковскийСчет;
			ИначеЕсли ДокументОбъект.СчетОрганизации.Владелец <> ДокументОбъект.Организация Тогда
				ДокументОбъект.СчетОрганизации = Неопределено;
			КонецЕсли;
		КонецЕсли;

		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("DMS_БанковскийСчетОрганизации", МетаданныеДокумента) Тогда
			Если НЕ ЗначениеЗаполнено(ДокументОбъект.DMS_БанковскийСчетОрганизации) Тогда
				ДокументОбъект.DMS_БанковскийСчетОрганизации = ДокументОбъект.Организация.ОсновнойБанковскийСчет;
			ИначеЕсли ДокументОбъект.DMS_БанковскийСчетОрганизации.Владелец <> ДокументОбъект.Организация Тогда
				ДокументОбъект.DMS_БанковскийСчетОрганизации = Неопределено;
			КонецЕсли;
		КонецЕсли;

		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("СтруктурнаяЕдиница", МетаданныеДокумента) Тогда
			Если НЕ ЗначениеЗаполнено(ДокументОбъект.СтруктурнаяЕдиница) Тогда
				ДокументОбъект.СтруктурнаяЕдиница = ДокументОбъект.Организация.ОсновнойБанковскийСчет;
			ИначеЕсли ДокументОбъект.СтруктурнаяЕдиница.Владелец <> ДокументОбъект.Организация Тогда
				ДокументОбъект.СтруктурнаяЕдиница = Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("ИспользоватьПлановуюСебестоимость", МетаданныеДокумента)
		И НЕ ДокументОбъект.ИспользоватьПлановуюСебестоимость Тогда
		ДокументОбъект.ИспользоватьПлановуюСебестоимость = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ИспользоватьПлановуюСебестоимость");
	КонецЕсли;
	
	ДатаДокумента = ?(НЕ ЗначениеЗаполнено(ДокументОбъект.Дата), Renault_Advanced_ОбщегоНазначения.ПолучитьРабочуюДату(),ДокументОбъект.Дата);

	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("ДоговорКонтрагента", МетаданныеДокумента) Тогда
		ИмяРеквизитаДоговор = "ДоговорКонтрагента";
	ИначеЕсли Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("ДоговорВзаиморасчетов", МетаданныеДокумента) Тогда
		ИмяРеквизитаДоговор = "ДоговорВзаиморасчетов";
	КонецЕсли;
	
	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("Контрагент", МетаданныеДокумента) Тогда

		Если НЕ ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
			Если ТипОперации = "Покупка" Тогда
				ДокументОбъект.Контрагент = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойПоставщик");
			ИначеЕсли ТипОперации = "Продажа" Тогда
				ДокументОбъект.Контрагент = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойПокупатель");
			КонецЕсли;
		КонецЕсли;

		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("КонтактноеЛицоКонтрагента", МетаданныеДокумента) Тогда
			Если (НЕ ЗначениеЗаполнено(ДокументОбъект.КонтактноеЛицоКонтрагента))
			   И ТипЗнч(ДокументОбъект.Контрагент) = Тип("СправочникСсылка.Контрагенты")
			   И ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
				ДокументОбъект.КонтактноеЛицоКонтрагента = ДокументОбъект.Контрагент.ОсновноеКонтактноеЛицо;
			Иначе
				ДокументОбъект.КонтактноеЛицоКонтрагента = Справочники.КонтактныеЛицаКонтрагентов.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		
		Если ИмяРеквизитаДоговор <> Неопределено Тогда
			Если НЕ ЗначениеЗаполнено(ДокументОбъект[ИмяРеквизитаДоговор]) 
			   И ТипЗнч(ДокументОбъект.Контрагент) = Тип("СправочникСсылка.Контрагенты") 
			   И ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда

				Если ТипЗнч(СтруктураПараметровДляПолученияДоговора) <> Тип("Структура") Тогда
					Если ТипОперации = "Продажа" Тогда 
						СтруктураПараметровДляПолученияДоговора = Renault_Advanced_ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПродажи();
					ИначеЕсли ТипОперации = "Покупка" Тогда 
						СтруктураПараметровДляПолученияДоговора = Renault_Advanced_ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПокупки();
					Иначе
						СтруктураПараметровДляПолученияДоговора = Неопределено;
					КонецЕсли;
				КонецЕсли;

				Организация = ?(Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", МетаданныеДокумента), 
				                                               ДокументОбъект.Организация, Неопределено);
				ДокументОбъект[ИмяРеквизитаДоговор] = Renault_Advanced_ЗаполнениеДокументов.ПолучитьДоговорПоОрганизацииИКонтрагенту(Организация, ДокументОбъект.Контрагент, СтруктураПараметровДляПолученияДоговора);
			КонецЕсли;

			Если ЗначениеЗаполнено(ДокументОбъект[ИмяРеквизитаДоговор])
			   И (ДокументОбъект[ИмяРеквизитаДоговор].Владелец <> ДокументОбъект.Контрагент 
			 Или (Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) 
			     И ЗначениеЗаполнено(ДокументОбъект.Организация) 
			   И ДокументОбъект[ИмяРеквизитаДоговор].Организация <> ДокументОбъект.Организация)) Тогда

				//если договор не соответствует контрагенту или организации - очистить договор
				ДокументОбъект[ИмяРеквизитаДоговор] = Неопределено; 
			КонецЕсли;

			Если ЗначениеЗаполнено(ДокументОбъект[ИмяРеквизитаДоговор]) Тогда

				//тип сделки имеет смысл устанавливать только в том случае, если заполнен договор
				Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("Сделка", МетаданныеДокумента) Тогда
					ЗаказПокупателя = Истина;
					Если ДокументОбъект[ИмяРеквизитаДоговор].ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком ИЛИ
						ДокументОбъект[ИмяРеквизитаДоговор].ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом Тогда
						ЗаказПокупателя = Ложь;
					КонецЕсли;
					Renault_Advanced_ЗаполнениеДокументов.УстановитьТипСделки(ДокументОбъект, ЗаказПокупателя, ИмяРеквизитаДоговор);
				КонецЕсли;
				
				//если в документе есть реквизит организация и он не заполнен
				// то заполняем из договора
				Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", МетаданныеДокумента)

					И НЕ ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда

					ДокументОбъект.Организация = ДокументОбъект[ИмяРеквизитаДоговор].Организация;
					
				КонецЕсли;
				
				ЕстьРеквизитКурсВзаиморасчетов      = Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("КурсВзаиморасчетов", МетаданныеДокумента);
				ЕстьРеквизитКратностьВзаиморасчетов = Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("КратностьВзаиморасчетов", МетаданныеДокумента);

				Если ЕстьРеквизитКурсВзаиморасчетов 
				 Или ЕстьРеквизитКратностьВзаиморасчетов Тогда
					СтруктураКурсаВзаиморасчетов = Renault_Advanced_МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОбъект[ИмяРеквизитаДоговор].ВалютаВзаиморасчетов, ДатаДокумента);
				КонецЕсли;

				Если ЕстьРеквизитКурсВзаиморасчетов Тогда
					ДокументОбъект.КурсВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Курс;
				КонецЕсли;

				Если ЕстьРеквизитКратностьВзаиморасчетов Тогда
					ДокументОбъект.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
				КонецЕсли;

				Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("ТипЦен", МетаданныеДокумента)
				   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ТипЦен)) Тогда
					ДокументОбъект.ТипЦен = Renault_AdvancedКлиент.ПолучитьРеквизитОбъекта(ДокументОбъект[ИмяРеквизитаДоговор], "ТипЦен");
				КонецЕсли;

			КонецЕсли;

		КонецЕсли; // есть реквизит договор

		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("БанковскийСчетКонтрагента", МетаданныеДокумента) 
		   И ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
			Если НЕ ЗначениеЗаполнено(ДокументОбъект.БанковскийСчетКонтрагента) Тогда
				ДокументОбъект.БанковскийСчетКонтрагента = ДокументОбъект.Контрагент.ОсновнойБанковскийСчет;
			ИначеЕсли ДокументОбъект.БанковскийСчетКонтрагента.Владелец <> ДокументОбъект.Контрагент Тогда
				ДокументОбъект.БанковскийСчетКонтрагента = Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;// есть реквизит контрагент
	
	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("Касса", МетаданныеДокумента) Тогда
		Если  Не ЗначениеЗаполнено(ДокументОбъект.Касса) Тогда
			ДокументОбъект.Касса = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнаяКасса");
		КонецЕсли;

		//Возможно заполненная касса не соответствует заполненной организации
		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", МетаданныеДокумента)
		   И ЗначениеЗаполнено(ДокументОбъект.Касса) Тогда
			Если ЗначениеЗаполнено(ДокументОбъект.Организация) 
			   И ДокументОбъект.Касса.Владелец <> ДокументОбъект.Организация Тогда
				ДокументОбъект.Касса = Неопределено;
			КонецЕсли;	
		КонецЕсли;

	КонецЕсли;

	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("КассаККМ", МетаданныеДокумента) Тогда
		//Возможно заполненная касса ККМ не соответствует заполненной организации
		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", МетаданныеДокумента) Тогда
			Если ЗначениеЗаполнено(ДокументОбъект.Организация) 
			   И ЗначениеЗаполнено(ДокументОбъект.КассаККМ)
			   И ДокументОбъект.КассаККМ.Владелец <> ДокументОбъект.Организация Тогда
				ДокументОбъект.КассаККМ = Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("ВалютаДокумента", МетаданныеДокумента) Тогда
		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("Касса", МетаданныеДокумента)
		   И ЗначениеЗаполнено(ДокументОбъект.Касса) Тогда
			ДокументОбъект.ВалютаДокумента = ДокументОбъект.Касса.ВалютаДенежныхСредств;
		ИначеЕсли Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("СчетОрганизации", МетаданныеДокумента)
		        И ЗначениеЗаполнено(ДокументОбъект.СчетОрганизации) Тогда
			ДокументОбъект.ВалютаДокумента = ДокументОбъект.СчетОрганизации.ВалютаДенежныхСредств;
		ИначеЕсли ИмяРеквизитаДоговор <> Неопределено
		        И ЗначениеЗаполнено(ДокументОбъект[ИмяРеквизитаДоговор]) Тогда
				Если НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
					ДокументОбъект.ВалютаДокумента = ДокументОбъект[ИмяРеквизитаДоговор].ВалютаВзаиморасчетов;
				КонецЕсли;
		ИначеЕсли НЕ ЗначениеЗаполнено(ДокументОбъект.ВалютаДокумента) Тогда
			ДокументОбъект.ВалютаДокумента = ВалютаРегламентированногоУчета;
		КонецЕсли;
	КонецЕсли;

	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("КурсДокумента", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.КурсДокумента)) Тогда
		СтруктураКурсаДокумента = Renault_Advanced_МодульВалютногоУчета.ПолучитьКурсВалюты(ДокументОбъект.ВалютаДокумента, ДатаДокумента);
		ДокументОбъект.КурсДокумента = СтруктураКурсаДокумента.Курс;

		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("КратностьДокумента", МетаданныеДокумента) Тогда
			ДокументОбъект.КратностьДокумента = СтруктураКурсаДокумента.Кратность;
		КонецЕсли;
	КонецЕсли;

	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("КурсВзаиморасчетов", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.КурсВзаиморасчетов)) Тогда
		СтруктураКурсаДокумента = Renault_Advanced_МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, ДатаДокумента);
		ДокументОбъект.КурсВзаиморасчетов = СтруктураКурсаДокумента.Курс;

		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("КратностьВзаиморасчетов", МетаданныеДокумента) Тогда
			ДокументОбъект.КратностьВзаиморасчетов = СтруктураКурсаДокумента.Кратность;
		КонецЕсли;
	КонецЕсли;

	флСуммаВключаетНДС = Истина;
	
	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("ТипЦен", МетаданныеДокумента) Тогда

		// Если тип цен оказался не заполненным, то берем его из установок пользователя
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.ТипЦен) И ТипОперации = "Продажа" Тогда
			ДокументОбъект.ТипЦен = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновнойТипЦенПродажи");
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокументОбъект.ТипЦен) Тогда

			// Если ТипЦен - элемент справочника ТипыЦенНоменклатуры и цены выбранного типа расчетные, 
			// то флаги включения налогов надо брать из базовой цены
			Если ТипЗнч(ДокументОбъект.ТипЦен) = Тип("СправочникСсылка.ТипыЦен") И ДокументОбъект.ТипЦен.Рассчитывается Тогда
				флСуммаВключаетНДС = ДокументОбъект.ТипЦен.БазовыйТипЦен.ЦенаВключаетНДС;
			Иначе
				флСуммаВключаетНДС = ДокументОбъект.ТипЦен.ЦенаВключаетНДС;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("УчитыватьНДС", МетаданныеДокумента) 
	   И (Не ДокументОбъект.УчитыватьНДС) Тогда

		ДокументОбъект.УчитыватьНДС = Истина;

		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("СуммаВключаетНДС", МетаданныеДокумента) Тогда
			ДокументОбъект.СуммаВключаетНДС = флСуммаВключаетНДС;
		КонецЕсли;
	КонецЕсли;


	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("ПериодРегистрации", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ПериодРегистрации)) Тогда
		ДокументОбъект.ПериодРегистрации = НачалоМесяца(ТекущаяДата());
	КонецЕсли;

	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("ВидПоступления", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ВидПоступления)) Тогда
		ДокументОбъект.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
	КонецЕсли;

	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("ВидПередачи", МетаданныеДокумента)
	   И (НЕ ЗначениеЗаполнено(ДокументОбъект.ВидПередачи)) Тогда
		ДокументОбъект.ВидПередачи = Перечисления.ВидыПередачиТоваров.СоСклада;
	КонецЕсли;

	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("УсловиеПродаж", МетаданныеДокумента)
	   И Не ЗначениеЗаполнено(ДокументОбъект.УсловиеПродаж) Тогда
		ДокументОбъект.УсловиеПродаж = Renault_Advanced_УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь, "ОсновноеУсловиеПродаж");
	КонецЕсли;

КонецПроцедуры // ЗаполнитьШапкуДокумента()

// Определяет курс документа, который равен либо курсу документа (если в документе он существует),
// либо курсу взаиморасчетов, либо 1.
//
// Параметры: 
//  ДокументОбъект                 - объект документа, курс которого надо получить
//  ВалютаРегламентированногоУчета - валюта регламентированного учета
//
// Возвращаемое значение:
//  Число - курс документа.
//
Функция КурсДокумента(ДокументОбъект, ВалютаРегламентированногоУчета) Экспорт

	// Если валюта документа совпадает с валютой регл. учета, то курс 1.
	Если (ТипЗнч(ДокументОбъект) <> Тип("ДокументОбъект.ЗаказНаряд") И ДокументОбъект.ВалютаДокумента <> ВалютаРегламентированногоУчета) Тогда
	
		МетаданныеДокумента = ДокументОбъект.Метаданные();

		// Если есть реквизит КурсДокумента - его и вернем
		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("КурсДокумента", МетаданныеДокумента) Тогда
			Возврат ДокументОбъект.КурсДокумента;
		КонецЕсли;

		// Если нет КурсДокумента и валюта документа не совпадает с валютой регл. учета, 
		// то такой документ может быть выписан только в валюте взаиморасчетов,
		// если есть реквизит КурсВзаиморасчетов - его и вернем.
		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("КурсВзаиморасчетов", МетаданныеДокумента) Тогда
			Возврат ДокументОбъект.КурсВзаиморасчетов;
		КонецЕсли;

	КонецЕсли;

	Возврат 1;

КонецФункции // КурсДокумента()

// Определяет кратность документа, которая равен либо кратности документа (если в документе она существует),
// либо кратности взаиморасчетов, либо 1.
//
// Параметры: 
//  ДокументОбъект - объект документа, курс которого надо получить
//  ВалютаРегламентированногоУчета - валюта регламентированного учета
//
// Возвращаемое значение:
//  Число - кратность валюты в документе.
//
Функция КратностьДокумента(ДокументОбъект, ВалютаРегламентированногоУчета) Экспорт

	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	// Если валюта документа совпадает с валютой регл. учета, то кратность 1.
	
	//Если ДокументОбъект.ЗаказНаряд.ВалютаДокумента <> ВалютаРегламентированногоУчета Тогда
	// [ВОРОБЬЕВ]] 06.02.2017 13:44:30 +++
	Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("ЗаказНаряд", МетаданныеДокумента)
	// [[ВОРОБЬЕВ]] --- 
		И ДокументОбъект.ЗаказНаряд.ВалютаДокумента <> ВалютаРегламентированногоУчета Тогда	
		
		// Если есть реквизит КратностьДокумента - его и вернем
		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("КратностьДокумента", МетаданныеДокумента) Тогда
			Возврат ДокументОбъект.КратностьДокумента;
		КонецЕсли;

		// Если нет КратностьДокумента и валюта документа не совпадает с валютой регл. учета, 
		// то такой документ может быть выписан только в валюте взаиморасчетов,
		// если есть реквизит КратностьВзаиморасчетов - его и вернем.
		Если Renault_Advanced_ОбщегоНазначения.ЕстьРеквизитДокумента("КратностьВзаиморасчетов", МетаданныеДокумента) Тогда
			Возврат ДокументОбъект.КратностьВзаиморасчетов;
		КонецЕсли;

	КонецЕсли;

	Возврат 1;

КонецФункции // КратностьДокумента()

// Формирует структуру параметров для получения договора покупки со значениями по умолчанию.
//
// Возвращаемое значение:
//   Стуртура – структура параметров для получения договора покупки.
//
Функция ПолучитьСтруктуруПараметровДляПолученияДоговораПокупки()  Экспорт

	СтруктураПараметровДляПолученияДоговора = Новый Структура();

	СписокДопустимыхВидовДоговоров = Новый СписокЗначений();
	СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);

	СтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовДоговоров", СписокДопустимыхВидовДоговоров);
	Возврат СтруктураПараметровДляПолученияДоговора;

КонецФункции // ПолучитьСтруктуруПараметровДляПолученияДоговораПокупки()

// Функция возвращает таблицу договоров данного контрагента, доступных для выбора
//
// Параметры
//  Контрагент                              - конрагент, по которому определяется договор
//  СтруктураПараметровДляПолученияДоговора - структура, содержащая параметры для определения договора:
//                                            список допустимых видов договоров и
//                                            список допустимых способов ведения взаиморасчетов, не обязательный.
// 	ВозвращатьТолькоПервые                  - булево, Истина - нужно вернуть только первые два договора,
//                                          - ложь - нужно вернуть весь список.
//  Организация                             - необязательный, организация, по которой определяется договор,
//                                            если не передана, то возвращается список договоров по всем орагнизациям.
//  ДополнительныеРеквизиты                 - необязательный, массив дополнительных реквизитов договора,
//                                            которые необходимо вернуть в результате запроса.
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция ПолучитьДоступныеДоговорыКонтрагента(Контрагент, СтруктураПараметровДляПолученияДоговора, ВозвращатьТолькоПервые, Организация = Неопределено, ДополнительныеРеквизиты = Неопределено) Экспорт

	Перем СписокДопустимыхВидовДоговоров, СписокДопустимыхВидовВзаиморасчетов, ВалютаВзаиморасчетовДоговора, ВидСравненияВалютыВзаиморасчетов;

	Если СтруктураПараметровДляПолученияДоговора <> Неопределено Тогда
		СтруктураПараметровДляПолученияДоговора.Свойство("СписокДопустимыхВидовДоговоров", СписокДопустимыхВидовДоговоров);
		СтруктураПараметровДляПолученияДоговора.Свойство("СписокДопустимыхВидовВзаиморасчетов", СписокДопустимыхВидовВзаиморасчетов);
		СтруктураПараметровДляПолученияДоговора.Свойство("ВалютаВзаиморасчетовДоговора", ВалютаВзаиморасчетовДоговора);
		СтруктураПараметровДляПолученияДоговора.Свойство("ВидСравненияВалютыВзаиморасчетов", ВидСравненияВалютыВзаиморасчетов);
	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ПарКонтрагент",  Контрагент);
	Запрос.УстановитьПараметр("ПарВидДоговора", СписокДопустимыхВидовДоговоров);
	Запрос.УстановитьПараметр("ПарВидВзаиморасчетов", СписокДопустимыхВидовВзаиморасчетов);
	Запрос.УстановитьПараметр("ПарВалютаВзаиморасчетов", ВалютаВзаиморасчетовДоговора);
	Запрос.УстановитьПараметр("ПарОрганизация", Организация);

	ПсевдонимТаблицы = "Renault_Advanced_РеквизитыДоговоровКонтрагентов"; 
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ"
	+?(ВозвращатьТолькоПервые," ПЕРВЫЕ 2","") + "
	|	Renault_Advanced_РеквизитыДоговоровКонтрагентов.ДоговорКонтрагента КАК Договор";
	
	Если ЗначениеЗаполнено(ДополнительныеРеквизиты) Тогда
		
		Для Каждого НаименованиеРеквизита Из ДополнительныеРеквизиты Цикл
		
			Запрос.Текст = Запрос.Текст  + ", " + ПсевдонимТаблицы + "." + НаименованиеРеквизита;
		
		КонецЦикла; 		
	
	КонецЕсли; 
	
	Запрос.Текст = Запрос.Текст  + "
	|ИЗ
	|	РегистрСведений.Renault_Advanced_РеквизитыДоговоровКонтрагентов КАК " + ПсевдонимТаблицы + "
	|ГДЕ
	|	(НЕ Renault_Advanced_РеквизитыДоговоровКонтрагентов.ДоговорКонтрагента.ПометкаУдаления)"
	+?(ЗначениеЗаполнено(Организация), "	И Renault_Advanced_РеквизитыДоговоровКонтрагентов.ДоговорКонтрагента.Организация = &ПарОрганизация", "") + "
	|	И Renault_Advanced_РеквизитыДоговоровКонтрагентов.ДоговорКонтрагента.Владелец    = &ПарКонтрагент"
	+?(ВалютаВзаиморасчетовДоговора = Неопределено, "", "
	|	И Renault_Advanced_РеквизитыДоговоровКонтрагентов.ДоговорКонтрагента.ВалютаВзаиморасчетов " 
	+?(ВидСравненияВалютыВзаиморасчетов = Неопределено, "=", ВидСравненияВалютыВзаиморасчетов) + "(&ПарВалютаВзаиморасчетов)
	|")
	+?(СписокДопустимыхВидовДоговоров = Неопределено, "", "
	|	И Renault_Advanced_РеквизитыДоговоровКонтрагентов.ДоговорКонтрагента.ВидДоговора В (&ПарВидДоговора)
	|")
	+?(СписокДопустимыхВидовВзаиморасчетов = Неопределено, "", "
	|	И Renault_Advanced_РеквизитыДоговоровКонтрагентов.ВедениеВзаиморасчетов В (&ПарВидВзаиморасчетов)
	|");
	
	Если СтруктураПараметровДляПолученияДоговора <> Неопределено И СтруктураПараметровДляПолученияДоговора.Свойство("ДоговорВЗаказНаряд") Тогда
		Запрос.Текст = Запрос.Текст + "	И Renault_Advanced_РеквизитыДоговоровКонтрагентов.ВедениеВзаиморасчетов = Значение(Перечисление.Renault_Advanced_ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам)
		|   И Renault_Advanced_РеквизитыДоговоровКонтрагентов.Автодоговор = ЗНАЧЕНИЕ(Справочник.Renault_Advanced_Договоры.ПустаяСсылка)
		|";		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Организация) Тогда 

		Запрос.Текст = Запрос.Текст + "
		|	И (ВЫБОР КОГДА Renault_Advanced_РеквизитыДоговоровКонтрагентов.ДоговорКонтрагента.Владелец.ОсновнойДоговорВзаиморасчетов.Организация = &ПарОрганизация"
		+?(ВалютаВзаиморасчетовДоговора = Неопределено, "", "
		|	И Renault_Advanced_РеквизитыДоговоровКонтрагентов.ДоговорКонтрагента.Владелец.ОсновнойДоговорВзаиморасчетов.ВалютаВзаиморасчетов " 
		+?(ВидСравненияВалютыВзаиморасчетов = Неопределено, "=", ВидСравненияВалютыВзаиморасчетов) + "&ПарВалютаВзаиморасчетов
		|")
		+ "
		|	         ТОГДА Renault_Advanced_РеквизитыДоговоровКонтрагентов.ДоговорКонтрагента.Ссылка  = Renault_Advanced_РеквизитыДоговоровКонтрагентов.ДоговорКонтрагента.Владелец.ОсновнойДоговорВзаиморасчетов
		|	         ИНАЧЕ Renault_Advanced_РеквизитыДоговоровКонтрагентов.ДоговорКонтрагента.Ссылка <> Renault_Advanced_РеквизитыДоговоровКонтрагентов.ДоговорКонтрагента.Владелец.ОсновнойДоговорВзаиморасчетов КОНЕЦ)";

	КонецЕсли;

	Возврат Запрос.Выполнить();

КонецФункции // ПолучитьДоступныеДоговорыКонтрагента()

// Устанавливает тип сделки документа
//
// Параметры:
//  ДокументОбъект  - объект документа, 
//  ЗаказПокупателя - признак заказа покупателю/поставщику
//
Процедура УстановитьТипСделки(ДокументОбъект, ЗаказПокупателя = Истина, ИмяРеквизитаДоговор = "ДоговорКонтрагента") Экспорт

	Сделка = Неопределено;

	ДоговорКонтрагента = ДокументОбъект[ИмяРеквизитаДоговор];

	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Если ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
		 Или ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда

			Сделка = Документы["Заказ"+?(ЗаказПокупателя, "Покупателя", "Поставщику")].ПустаяСсылка()

		ИначеЕсли ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам тогда

			НадписьСделка = "Счет "+?(ЗаказПокупателя,"покупателю:", "поставщика:");
			Сделка = Документы["СчетНаОплату"+?(ЗаказПокупателя, "Покупателю", "Поставщика")].ПустаяСсылка()

		КонецЕсли;
	КонецЕсли;

	// Поменяем значение сделки, если она не того типа.
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Сделка)
	   И ТипЗнч(ДокументОбъект.Сделка) <> ТипЗнч(Сделка) Тогда

		ДокументОбъект.Сделка = Сделка;

	КонецЕсли;

КонецПроцедуры // УстановитьТипСделки()

// Формирует структуру параметров для получения договора продажи со значениями по умолчанию.
//
// Возвращаемое значение:
//   Стуртура – структура параметров для получения договора продажи.
//
Функция ПолучитьСтруктуруПараметровДляПолученияДоговораПродажи()  Экспорт

	СтруктураПараметровДляПолученияДоговора = Новый Структура();

	СписокДопустимыхВидовДоговоров = Новый СписокЗначений();
	СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоров.Продажа);
	СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоров.СКомиссионером);

	СтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовДоговоров", СписокДопустимыхВидовДоговоров);
	Возврат СтруктураПараметровДляПолученияДоговора;

КонецФункции // ПолучитьСтруктуруПараметровДляПолученияДоговораПродажи()
